IRP/src/DataProcessors/AccountingService/AccountingService.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
 <name>AccountingService</name>
</mdclass:DataProcessor>

IRP/src/Documents/JournalEntry/JournalEntry.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
 <name>JournalEntry</name>
 <posting>Deny</posting>
 <registerRecords>AccountingRegister.Basic</registerRecords>
 <attributes>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </attributes>
 <attributes>
  <name>LedgerType</name>
  <type>
   <types>CatalogRef.LedgerTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>Basis</name>
  <type>
   <types>DefinedType.typeAccountingDocuments</types>
  </type>
 </attributes>
 <attributes>
  <name>UserDefined</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>Errors</name>
  <attributes>
   <name>Error</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>1024</length>
    </stringQualifiers>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Document>

IRP/src/DataProcessors/AccountingService/ManagerModule.bsl
Function RunEAOExchangeAtServer(IntegrationSettingsRef) Export
	ResultStructure = New Structure;
	ResultStructure.Insert("SpreadSheetDoc", Undefined);
	ResultStructure.Insert("Result", True);
	ResultStructure.Insert("Error", "");
	
	TestRegisterName = "";
	
	Try
		EAOResultArray = New Array;
		AccountingServer.LoadAccountingRecordsAll(IntegrationSettingsRef, TestRegisterName, EAOResultArray);
		If EAOResultArray.Count() = 0 Then
			Return ResultStructure;
		EndIf;
		ArrayOfLedgerTypes = GetArrayOfLedgerTypes();
		AccountingServer.CreateJE_ByArrayRefs(EAOResultArray, ArrayOfLedgerTypes);
		
		ErrorsStructure = New Structure();
		ErrorsStructure.Insert("TableErrorsInEAOArray", TableErrorsInEAO(EAOResultArray));
		ErrorsStructure.Insert("TableErrorInJE", TableErrorsInJE(EAOResultArray));
		
		SpreadSheetDoc = Undefined;
		If ErrorsStructure.TableErrorsInEAOArray.Count() Or ErrorsStructure.TableErrorInJE.Count() Then
			SpreadSheetDoc = CreateReportByErrors(ErrorsStructure);
		EndIf;
		ResultStructure.SpreadSheetDoc = SpreadSheetDoc;
	Except
		Error = ErrorDescription();
		CommonFunctionsClientServer.ShowUsersMessage(Error);
		
		ResultStructure.Result = False;
		ResultStructure.Error = Error;
	EndTry;
	
	Return ResultStructure;
EndFunction

Function CreateReportByErrors(ErrorsStructure)
	
	SDocument = New SpreadsheetDocument;
	Template = DataProcessors.AccountingService.GetTemplate("EAOLoadReport");
	AreaHeader = Template.GetArea("Header");
	AreaRow = Template.GetArea("Row");
	
	SDocument.Put(AreaHeader);
	For Each TableRow In ErrorsStructure.TableErrorsInEAOArray Do
		FillPropertyValues(AreaRow.Parameters, TableRow);
		SDocument.Put(AreaRow);
	EndDo;
	For Each TableRow In ErrorsStructure.TableErrorInJE Do
		FillPropertyValues(AreaRow.Parameters, TableRow);
		SDocument.Put(AreaRow);
	EndDo;
	
	SDocument.ShowGrid = False;
	SDocument.ShowHeaders = False;
	SDocument.FixedTop = 2;
	SDocument.ReadOnly = True;
	
	Return SDocument;
	
EndFunction

Function TableErrorsInJE(EAOArray)
	Query = New Query;
	Query.SetParameter("ArrayOfBasis", EAOArray);
	Query.Text = 
	"SELECT
	|	JournalEntryErrors.Ref AS DocumentRef,
	|	JournalEntryErrors.Error AS Error
	|FROM
	|	Document.JournalEntry.Errors AS JournalEntryErrors
	|WHERE
	|	JournalEntryErrors.Ref.Basis IN (&ArrayOfBasis)
	|	AND NOT JournalEntryErrors.Ref.DeletionMark
	|
	|ORDER BY
	|	DocumentRef";
		
	Table = Query.Execute().Unload();
	
	Return Table;
EndFunction

Function TableErrorsInEAO(EAOArray)
	Query = New Query;
	Query.SetParameter("EAOArray", EAOArray);
	Query.Text = 
	"SELECT
	|	ExternalAccountingOperationErrors.Error AS Error,
	|	ExternalAccountingOperationErrors.Ref AS DocumentRef
	|FROM
	|	Document.ExternalAccountingOperation.Errors AS ExternalAccountingOperationErrors
	|WHERE
	|	ExternalAccountingOperationErrors.Ref IN (&EAOArray)
	|
	|ORDER BY
	|	DocumentRef";
	
	Table = Query.Execute().Unload();
	
	Return Table;
EndFunction

&AtServer
Function GetArrayOfLedgerTypes()
	Query = New Query();
	Query.Text = 
	"SELECT
	|	LedgerTypes.Ref AS LedgerType
	|FROM
	|	Catalog.LedgerTypes AS LedgerTypes
	|WHERE
	|	NOT LedgerTypes.DeletionMark";
	
	QueryResult = Query.Execute();
	QueryTable = QueryResult.Unload();
	
	ArrayOfLedgerTypes = QueryTable.UnloadColumn("LedgerType");
	
	Return ArrayOfLedgerTypes;
EndFunction

&AtClient
Procedure RunEAOExchange(Command)
	RunEAOExchangeAtServer();
EndProcedure
